## Introduction

Content
 

The following is the description of the dataset 20 attributes:


•	dateCrawled:  The date when this advertisement was first crawled, all field-values were obtained on this date.

•	name: "name" of the car.

•	seller:  seller type – private or dealer.

•	offerType: Offer Type - offer or request.

•	price: the price in Euro on the advertisement to sell the car.

•	abtest: abtest category - test or control

•	vehicleType: vehicle body type - limousine, small car, station wagon, bus, cabrio, coupe, suv, other.

•	yearOfRegistration: At what year the car was first registered - the age of the car.

•	Transmission: Transmission Type - manual or automatic.

•	powerPS: Car Engine Power in PS

•	model: car model.

•	Kilometer: car mileage in kilometer.

•	monthOfRegistration: the month of the year the car was first registered.

•	fuelType: Fuel Type - gas, diesel, autogas, compressed natural gas, hybrid, other, or electric.

•	Brand: car brand

•	notRepairedDamage: Unrepaired Damage - yes or no.

•	dateCreated: The date the ad was created on Ebay-Kleinanzeigen.

•	nrOfPictures: number of pictures in the ad

•	postalCode: car seller postal code 

•	lastSeen: when the crawler saw this ad last online

## Required Libraries and dataset

In [17]:
# Load the pandas,numpy,matplotlib and other required libraries with an import statement
import pandas as pd                # importing pandas as pd
import numpy as np                 # importing numpy as np    
import matplotlib.pyplot as plt    #importing matplotlib as plt
import seaborn as sns              #importing seaborn as sns
%matplotlib inline
import datetime
from dateutil.relativedelta import relativedelta
from datetime import date
from datetime import time

In [18]:
df = pd.read_csv('auto_convert.csv', sep=',',low_memory=False, encoding ='latin-1')

In [19]:
df.head()

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
0,24-03-16 11:52,Golf_3_1.6,private,offer,480.0,test,NaN,1993.0,manual,0.0,golf,150000,0.0,gas,volkswagen,NaN,24-03-16 0:00,0.0,70435.0,07-04-16 3:16
1,24-03-16 10:58,A5_Sportback_2.7_Tdi,private,offer,18300.0,test,coupe,2011.0,manual,190.0,NaN,125000,5.0,diesel,audi,yes,24-03-16 0:00,0.0,66954.0,07-04-16 1:46
2,14-03-16 12:52,"Jeep_Grand_Cherokee_""Overland""",private,offer,9800.0,test,suv,2004.0,automatic,163.0,grand,125000,8.0,diesel,jeep,NaN,14-03-16 0:00,0.0,90480.0,05-04-16 12:47
3,17-03-16 16:54,GOLF_4_1_4__3TÃRER,private,offer,1500.0,test,small car,2001.0,manual,75.0,golf,150000,6.0,gas,volkswagen,no,17-03-16 0:00,0.0,91074.0,17-03-16 17:40
4,31-03-16 17:25,Skoda_Fabia_1.4_TDI_PD_Classic,private,offer,3600.0,test,small car,2008.0,manual,69.0,fabia,90000,7.0,diesel,skoda,no,31-03-16 0:00,0.0,60437.0,06-04-16 10:17

## Knowing the dataset

In [20]:
# Display summary of the dataframe including the data types of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371539 entries, 0 to 371538
Data columns (total 20 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   dateCrawled          371539 non-null  object
 1   name                 371539 non-null  object
 2   seller               371538 non-null  object
 3   offerType            371538 non-null  object
 4   price                371538 non-null  float64
 5   abtest               371538 non-null  object
 6   vehicleType          333669 non-null  object
 7   yearOfRegistration   371537 non-null  float64
 8   gearbox              351329 non-null  object
 9   powerPS              371538 non-null  float64
 10  model                351054 non-null  object
 11  kilometer            371538 non-null  object
 12  monthOfRegistration  371537 non-null  float64
 13  fuelType             338151 non-null  object
 14  brand                371537 non-null  object
 15  notRepairedDamage    299477 non-null  object
 16  dateCreated          371537 non-null  object
 17  nrOfPictures         371537 non-null  float64
 18  postalCode           371537 non-null  float64
 19  lastSeen             371537 non-null  object
dtypes: float64(6), object(14)
memory usage: 56.7+ MB

In [21]:
# Checking the unique values
print(df.nunique())

dateCrawled             15623
name                   233527
seller                      3
offerType                   3
price                    5597
abtest                      3
vehicleType                 9
yearOfRegistration        155
gearbox                     3
powerPS                   794
model                     252
kilometer                  14
monthOfRegistration        13
fuelType                    7
brand                      40
notRepairedDamage           2
dateCreated               114
nrOfPictures                1
postalCode               8150
lastSeen                18705
dtype: int64

In [22]:
#Frequency Counts of offerType
df['offerType'].value_counts()

offer      371525
request        12
150000          1
Name: offerType, dtype: int64

In [23]:
# Frequency Counts of seller Types
df['seller'].value_counts()

private    371534
dealer          3
golf            1
Name: seller, dtype: int64

In [24]:
# Frequency counts of abtest
df['abtest'].value_counts()

test       192591
control    178946
gas             1
Name: abtest, dtype: int64

In [25]:
# Frequency counts of vehicleType
df['vehicleType'].value_counts(1)

limousine        0.287399
small car        0.239836
station wagon    0.202488
bus              0.090515
cabrio           0.068628
coupe            0.056991
suv              0.044080
other            0.010061
volkswagen       0.000003
Name: vehicleType, dtype: float64

In [26]:
# Frequency counts of yearofRegistration
df['yearOfRegistration'].value_counts().nlargest(20)

2000.0    24552
1999.0    22768
2005.0    22316
2006.0    20232
2001.0    20218
2003.0    19873
2004.0    19746
2002.0    19189
1998.0    17951
2007.0    17673
2008.0    16175
2009.0    15607
1997.0    14707
2010.0    12354
2011.0    12068
1996.0    10886
2017.0    10546
2016.0     9859
1995.0     9658
2012.0     9418
Name: yearOfRegistration, dtype: int64

In [27]:
# Frequency counts of Transmission Types
df['gearbox'].value_counts(1)

manual           0.780519
automatic        0.219478
25-03-16 0:00    0.000003
Name: gearbox, dtype: float64

In [28]:
# Frequency counts of fuelType
df['fuelType'].value_counts(1)

gas                       0.662021
diesel                    0.318639
autogas                   0.015904
compressed natural gas    0.001689
hybrid                    0.000825
other                     0.000615
electric                  0.000308
Name: fuelType, dtype: float64

In [29]:
# Frequency counts of notRepairedDamage
df['notRepairedDamage'].value_counts(1)

no     0.878829
yes    0.121171
Name: notRepairedDamage, dtype: float64

In [30]:
# Find the number of non-NA/null value across each column
df.count()

dateCrawled            371539
name                   371539
seller                 371538
offerType              371538
price                  371538
abtest                 371538
vehicleType            333669
yearOfRegistration     371537
gearbox                351329
powerPS                371538
model                  351054
kilometer              371538
monthOfRegistration    371537
fuelType               338151
brand                  371537
notRepairedDamage      299477
dateCreated            371537
nrOfPictures           371537
postalCode             371537
lastSeen               371537
dtype: int64

In [31]:
# Frequency Counts of kilometer values
df['kilometer'].value_counts()

150000           240802
125000            38067
100000            15920
90000             12524
80000             11053
70000              9773
60000              8669
50000              7616
5000               7070
40000              6377
30000              6041
20000              5676
10000              1949
30-03-16 0:44         1
Name: kilometer, dtype: int64

In [32]:
# Find the number of NaN values in each column 
autos_missing_values = df.isnull().sum()

In [33]:
autos_missing_values

dateCrawled                0
name                       0
seller                     1
offerType                  1
price                      1
abtest                     1
vehicleType            37870
yearOfRegistration         2
gearbox                20210
powerPS                    1
model                  20485
kilometer                  1
monthOfRegistration        2
fuelType               33388
brand                      2
notRepairedDamage      72062
dateCreated                2
nrOfPictures               2
postalCode                 2
lastSeen                   2
dtype: int64

In [34]:
# Find the number of rows and columns in the dataset
# Check the dataset size
df.shape

(371539, 20)

In [35]:
# Descriptive or Summary statistics of numeric columns
df.describe()

,price,yearOfRegistration,powerPS,monthOfRegistration,nrOfPictures,postalCode
count,3.715380e+05,371537.000000,371538.000000,371537.000000,371537.0,371537.000000
mean,1.729544e+04,2004.577883,115.548840,5.734473,0.0,50820.666402
std,3.587905e+06,92.865496,192.137238,3.712383,0.0,25799.080292
min,0.000000e+00,1000.000000,0.000000,0.000000,0.0,1067.000000
25%,1.150000e+03,1999.000000,70.000000,3.000000,0.0,30459.000000
50%,2.950000e+03,2003.000000,105.000000,6.000000,0.0,49610.000000
75%,7.200000e+03,2008.000000,150.000000,9.000000,0.0,71546.000000
max,2.147484e+09,9999.000000,20000.000000,12.000000,0.0,99998.000000

In [36]:
# Summary statistics of character or non-numeric columns
df.describe(include=['object'])

,dateCrawled,name,seller,offerType,abtest,vehicleType,gearbox,model,kilometer,fuelType,brand,notRepairedDamage,dateCreated,lastSeen
count,371539,371539,371538,371538,371538,333669,351329,351054,371538,338151,371537,299477,371537,371537
unique,15623,233527,3,3,3,9,3,252,14,7,40,2,114,18705
top,05-03-16 14:25,Ford_Fiesta,private,offer,test,limousine,manual,golf,150000,gas,volkswagen,no,03-04-16 0:00,07-04-16 6:45
freq,68,657,371534,371525,192591,95896,274219,30070,240802,223863,79640,263189,14451,708

## Create meaningful Column names

To change the column names using rename function in Pandas, one needs to specify a mapper, a dictionary with old name as keys and new name as values.  We will also use inplace=True to change column names in place.

In [37]:
# Change column names using rename function

df.rename(columns={'dateCrawled':'Date_Crawled',
                   'name':'Car_Name',
                   'seller':'Car_Seller_Type',
                   'offerType':'Offer_Type',
                   'price':'Car_Price',
                   'abtest':'Abtest_Type',
                   'vehicleType':'Vehicle_Type',
                   'yearOfRegistration':'Year_of_Car_Registration',
                   'gearbox':'Car_Transmission_Type',
                   'powerPS':'Car_Engine_Power_PS',
                   'model':'Car_Model',
                   'kilometer':'Car_Mileage_Kilometer',
                   'monthOfRegistration':'Month_of_Car_Registration',
                   'fuelType':'Fuel_Type',
                   'brand':'Car_Brand',
                   'notRepairedDamage': 'UnRepaired_Damage',
                   'dateCreated': 'Date_Created',
                   'nrOfPictures': 'No_of_Pictures',
                   'postalCode': 'Seller_Postal_Code',
                   'lastSeen': 'Date_LastSeen_Online'},                         
                   inplace=True)

In [38]:
# Make a copy of the dataframe
autos_df = df.copy()

In [39]:
# Display the first five lines of the dataframe
autos_df.head()

,Date_Crawled,Car_Name,Car_Seller_Type,Offer_Type,Car_Price,Abtest_Type,Vehicle_Type,Year_of_Car_Registration,Car_Transmission_Type,Car_Engine_Power_PS,Car_Model,Car_Mileage_Kilometer,Month_of_Car_Registration,Fuel_Type,Car_Brand,UnRepaired_Damage,Date_Created,No_of_Pictures,Seller_Postal_Code,Date_LastSeen_Online
0,24-03-16 11:52,Golf_3_1.6,private,offer,480.0,test,NaN,1993.0,manual,0.0,golf,150000,0.0,gas,volkswagen,NaN,24-03-16 0:00,0.0,70435.0,07-04-16 3:16
1,24-03-16 10:58,A5_Sportback_2.7_Tdi,private,offer,18300.0,test,coupe,2011.0,manual,190.0,NaN,125000,5.0,diesel,audi,yes,24-03-16 0:00,0.0,66954.0,07-04-16 1:46
2,14-03-16 12:52,"Jeep_Grand_Cherokee_""Overland""",private,offer,9800.0,test,suv,2004.0,automatic,163.0,grand,125000,8.0,diesel,jeep,NaN,14-03-16 0:00,0.0,90480.0,05-04-16 12:47
3,17-03-16 16:54,GOLF_4_1_4__3TÃRER,private,offer,1500.0,test,small car,2001.0,manual,75.0,golf,150000,6.0,gas,volkswagen,no,17-03-16 0:00,0.0,91074.0,17-03-16 17:40
4,31-03-16 17:25,Skoda_Fabia_1.4_TDI_PD_Classic,private,offer,3600.0,test,small car,2008.0,manual,69.0,fabia,90000,7.0,diesel,skoda,no,31-03-16 0:00,0.0,60437.0,06-04-16 10:17

## Missing Values

There are missing values identified as NaNs in the dataset. However, these are not the only missing values. 
The data used '0.0' as missing values as well. Specifically, the data used 0.0 in Car_Price(Euros), 
Car_Engine_Power_PS, Month_of_Car_Registration and No_of_Pictures as missing values as well.
And these have to be cleaned up. 
Null values would result in bias resulting from differences between missing and complete data.

In [40]:
# Convert zeros(0.0) to missing values - Replace 0 with NaNs
autos_df.replace(0.0, np.nan, inplace=True)

In [41]:
autos_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371539 entries, 0 to 371538
Data columns (total 20 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Date_Crawled               371539 non-null  object
 1   Car_Name                   371539 non-null  object
 2   Car_Seller_Type            371538 non-null  object
 3   Offer_Type                 371538 non-null  object
 4   Car_Price                  360760 non-null  float64
 5   Abtest_Type                371538 non-null  object
 6   Vehicle_Type               333669 non-null  object
 7   Year_of_Car_Registration   371537 non-null  float64
 8   Car_Transmission_Type      351329 non-null  object
 9   Car_Engine_Power_PS        330716 non-null  float64
 10  Car_Model                  351054 non-null  object
 11  Car_Mileage_Kilometer      371538 non-null  object
 12  Month_of_Car_Registration  333862 non-null  float64
 13  Fuel_Type                  338151 non-null  object
 14  Car_Brand                  371537 non-null  object
 15  UnRepaired_Damage          299477 non-null  object
 16  Date_Created               371537 non-null  object
 17  No_of_Pictures             0 non-null       float64
 18  Seller_Postal_Code         371537 non-null  float64
 19  Date_LastSeen_Online       371537 non-null  object
dtypes: float64(6), object(14)
memory usage: 56.7+ MB

In [42]:
autos_df.isnull().sum()

Date_Crawled                      0
Car_Name                          0
Car_Seller_Type                   1
Offer_Type                        1
Car_Price                     10779
Abtest_Type                       1
Vehicle_Type                  37870
Year_of_Car_Registration          2
Car_Transmission_Type         20210
Car_Engine_Power_PS           40823
Car_Model                     20485
Car_Mileage_Kilometer             1
Month_of_Car_Registration     37677
Fuel_Type                     33388
Car_Brand                         2
UnRepaired_Damage             72062
Date_Created                      2
No_of_Pictures               371539
Seller_Postal_Code                2
Date_LastSeen_Online              2
dtype: int64

## Change column types to appropriate data types

In [43]:
autos_df2 = autos_df.copy()

In [44]:
# Change Date_Crawled, Date_Created, and Date_LastSeen_Online column data type from string to date 
autos_df2['Date_Created'] = pd.to_datetime(autos_df2['Date_Created'])

In [45]:
# Change Date_Crawled, Date_Created, and Date_LastSeen_Online column data type from string to date 
autos_df2['Date_LastSeen_Online'] = pd.to_datetime(autos_df2['Date_LastSeen_Online'])

In [46]:
autos_df2.isnull().sum()

Date_Crawled                      0
Car_Name                          0
Car_Seller_Type                   1
Offer_Type                        1
Car_Price                     10779
Abtest_Type                       1
Vehicle_Type                  37870
Year_of_Car_Registration          2
Car_Transmission_Type         20210
Car_Engine_Power_PS           40823
Car_Model                     20485
Car_Mileage_Kilometer             1
Month_of_Car_Registration     37677
Fuel_Type                     33388
Car_Brand                         2
UnRepaired_Damage             72062
Date_Created                      2
No_of_Pictures               371539
Seller_Postal_Code                2
Date_LastSeen_Online              2
dtype: int64

It is important to deal with missing values to get the dataset into a more useful form by deleting 
columns and rows that are not required for further analysis. Furthermore, decision should be made on 
how to treat NaNs/missing values.

In [47]:
#Summarize the number of rows and columns in the dataset
print(autos_df2.shape)

(371539, 20)

In [48]:
# Drop the rows where all elements are missing
autos_clean_df = autos_df2.dropna(how ='all')

In [49]:
#Summarize the number of rows and columns in the dataset
print(autos_clean_df.shape)

(371539, 20)

In [50]:
# Drop rows that contain less than five observations
autos_clean_df = autos_clean_df.dropna(thresh=5)

In [51]:
#Summarize the number of rows and columns in the dataset
print(autos_clean_df.shape)

(371538, 20)

In [52]:
# The No_of_Pictures column contains missing values only, we need to remove it.
# We won't get anything meaningful from a column with all missing values
autos_clean_df = autos_clean_df.drop('No_of_Pictures', axis=1)

In [53]:
#Summarize the number of rows and columns in the dataset
print(autos_clean_df.shape)

(371538, 19)

In [54]:
autos_clean_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 371538 entries, 0 to 371538
Data columns (total 19 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Date_Crawled               371538 non-null  object
 1   Car_Name                   371538 non-null  object
 2   Car_Seller_Type            371538 non-null  object
 3   Offer_Type                 371538 non-null  object
 4   Car_Price                  360760 non-null  float64
 5   Abtest_Type                371538 non-null  object
 6   Vehicle_Type               333669 non-null  object
 7   Year_of_Car_Registration   371537 non-null  float64
 8   Car_Transmission_Type      351329 non-null  object
 9   Car_Engine_Power_PS        330716 non-null  float64
 10  Car_Model                  351054 non-null  object
 11  Car_Mileage_Kilometer      371538 non-null  object
 12  Month_of_Car_Registration  333862 non-null  float64
 13  Fuel_Type                  338151 non-null  object
 14  Car_Brand                  371537 non-null  object
 15  UnRepaired_Damage          299477 non-null  object
 16  Date_Created               371537 non-null  datetime64[ns]
 17  Seller_Postal_Code         371537 non-null  float64
 18  Date_LastSeen_Online       371537 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(5), object(12)
memory usage: 56.7+ MB

## Drop columns not required for further data analysis

In [55]:
autos_clean_df = autos_clean_df.drop(['Date_Crawled','Car_Name'], axis=1)

In [56]:
autos_clean_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 371538 entries, 0 to 371538
Data columns (total 17 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Car_Seller_Type            371538 non-null  object
 1   Offer_Type                 371538 non-null  object
 2   Car_Price                  360760 non-null  float64
 3   Abtest_Type                371538 non-null  object
 4   Vehicle_Type               333669 non-null  object
 5   Year_of_Car_Registration   371537 non-null  float64
 6   Car_Transmission_Type      351329 non-null  object
 7   Car_Engine_Power_PS        330716 non-null  float64
 8   Car_Model                  351054 non-null  object
 9   Car_Mileage_Kilometer      371538 non-null  object
 10  Month_of_Car_Registration  333862 non-null  float64
 11  Fuel_Type                  338151 non-null  object
 12  Car_Brand                  371537 non-null  object
 13  UnRepaired_Damage          299477 non-null  object
 14  Date_Created               371537 non-null  datetime64[ns]
 15  Seller_Postal_Code         371537 non-null  float64
 16  Date_LastSeen_Online       371537 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(5), object(10)
memory usage: 51.0+ MB

## Cleaning up Erronous Values  - Outliers Removal

## Anomalies

There is a need to examine the remaining columns and remove errornous values from the columns. 
For example, there is no way we could have a car with year of registration as 2018,5300,5600 or 7777 in 2016. Extreme values should also be removed from the columns.

In [57]:
# Summary statistics for Car_Engine_Power_PS
print(autos_clean_df['Car_Engine_Power_PS'].describe())

count    330716.000000
mean        129.811636
std         199.052939
min           1.000000
25%          80.000000
50%         116.000000
75%         150.000000
max       20000.000000
Name: Car_Engine_Power_PS, dtype: float64

In [58]:
# Remove rows with erroneous engine power values 
# Limit Car Engine Power PS the range of 1 to 999

autos_clean_df = autos_clean_df[(autos_clean_df.Car_Engine_Power_PS > 0) & (autos_clean_df.Car_Engine_Power_PS < 1000)]

In [59]:
# Summary statistics for Car_Engine_Power_PS
print(autos_clean_df['Car_Engine_Power_PS'].describe())

count    330402.000000
mean        125.976126
std          62.834024
min           1.000000
25%          80.000000
50%         116.000000
75%         150.000000
max         999.000000
Name: Car_Engine_Power_PS, dtype: float64

In [60]:
# Summary statistics for Car_Price in Euros
print(autos_clean_df['Car_Price'].describe())

count    3.235100e+05
mean     1.705253e+04
std      3.818116e+06
min      1.000000e+00
25%      1.400000e+03
50%      3.490000e+03
75%      7.950000e+03
max      2.147484e+09
Name: Car_Price, dtype: float64

In [61]:
autos_clean_df.Car_Price.max()

2147483647.0

In [62]:
# Let us keep the price within the range of 1 to 100,000
autos_clean_df = autos_clean_df[(autos_clean_df.Car_Price > 0) & (autos_clean_df.Car_Price < 100000)]

In [63]:
# Summary statistics for Car_Price in Euros
print(autos_clean_df['Car_Price'].describe())

count    323165.000000
mean       6110.159405
std        7696.048710
min           1.000000
25%        1400.000000
50%        3450.000000
75%        7900.000000
max       99999.000000
Name: Car_Price, dtype: float64

In [64]:
# Remove rows with errornous year of car registration values
# Let us focus the dataset on car year of registration between 1950 and 2017
autos_clean_df = autos_clean_df[(autos_clean_df.Year_of_Car_Registration > 1950) & (autos_clean_df.Year_of_Car_Registration < 2017)]

In [65]:
# Remove rows with UnRepaired_Damage Null/Nan values
autos_cleaned_df = autos_clean_df[pd.notnull(autos_clean_df['UnRepaired_Damage'])]

In [66]:
# Remove rows with Month_of_Car_Registration Null/Nan values
autos_cleaned_df = autos_cleaned_df[pd.notnull(autos_cleaned_df['Month_of_Car_Registration'])]

In [67]:
# Remove rows with Fuel_Type Null/Nan values
autos_cleaned_df = autos_cleaned_df[pd.notnull(autos_cleaned_df['Fuel_Type'])]

In [68]:
# Remove rows with Car_Model Null/Nan values
autos_cleaned_df = autos_cleaned_df[pd.notnull(autos_cleaned_df['Car_Model'])]

In [69]:
# Remove rows with Car_Price(Euros) Null/Nan values
autos_cleaned_df = autos_cleaned_df[pd.notnull(autos_cleaned_df['Car_Transmission_Type'])]

In [70]:
# Remove rows with Car_Price(Euros) Null/Nan values
autos_cleaned_df = autos_cleaned_df[pd.notnull(autos_cleaned_df['Vehicle_Type'])]

In [71]:
autos_cleaned_df.isnull().sum()

Car_Seller_Type              0
Offer_Type                   0
Car_Price                    0
Abtest_Type                  0
Vehicle_Type                 0
Year_of_Car_Registration     0
Car_Transmission_Type        0
Car_Engine_Power_PS          0
Car_Model                    0
Car_Mileage_Kilometer        0
Month_of_Car_Registration    0
Fuel_Type                    0
Car_Brand                    0
UnRepaired_Damage            0
Date_Created                 0
Seller_Postal_Code           0
Date_LastSeen_Online         0
dtype: int64

We finally have a completely cleaned dataset for further data analysis

In [72]:
autos_cleaned_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 242205 entries, 3 to 371538
Data columns (total 17 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Car_Seller_Type            242205 non-null  object
 1   Offer_Type                 242205 non-null  object
 2   Car_Price                  242205 non-null  float64
 3   Abtest_Type                242205 non-null  object
 4   Vehicle_Type               242205 non-null  object
 5   Year_of_Car_Registration   242205 non-null  float64
 6   Car_Transmission_Type      242205 non-null  object
 7   Car_Engine_Power_PS        242205 non-null  float64
 8   Car_Model                  242205 non-null  object
 9   Car_Mileage_Kilometer      242205 non-null  object
 10  Month_of_Car_Registration  242205 non-null  float64
 11  Fuel_Type                  242205 non-null  object
 12  Car_Brand                  242205 non-null  object
 13  UnRepaired_Damage          242205 non-null  object
 14  Date_Created               242205 non-null  datetime64[ns]
 15  Seller_Postal_Code         242205 non-null  float64
 16  Date_LastSeen_Online       242205 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(5), object(10)
memory usage: 33.3+ MB

In [73]:
autos_cleaned_df.head()

,Car_Seller_Type,Offer_Type,Car_Price,Abtest_Type,Vehicle_Type,Year_of_Car_Registration,Car_Transmission_Type,Car_Engine_Power_PS,Car_Model,Car_Mileage_Kilometer,Month_of_Car_Registration,Fuel_Type,Car_Brand,UnRepaired_Damage,Date_Created,Seller_Postal_Code,Date_LastSeen_Online
3,private,offer,1500.0,test,small car,2001.0,manual,75.0,golf,150000,6.0,gas,volkswagen,no,2016-03-17,91074.0,2016-03-17 17:40:00
4,private,offer,3600.0,test,small car,2008.0,manual,69.0,fabia,90000,7.0,diesel,skoda,no,2016-03-31,60437.0,2016-06-04 10:17:00
5,private,offer,650.0,test,limousine,1995.0,manual,102.0,3er,150000,10.0,gas,bmw,yes,2016-04-04,33775.0,2016-06-04 19:17:00
6,private,offer,2200.0,test,cabrio,2004.0,manual,109.0,2_reihe,150000,8.0,gas,peugeot,no,2016-01-04,67112.0,2016-05-04 18:18:00
10,private,offer,2000.0,control,limousine,2004.0,manual,105.0,3_reihe,150000,12.0,gas,mazda,no,2016-03-26,96224.0,2016-06-04 10:45:00

In [74]:
autos_cleaned_df.to_csv("autos_cleaned_data.csv", index=False)